ДемоПримерыОбменов/src/InformationRegisters/ДатыБронирований/ДатыБронирований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыБронирований</name>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>CatalogRef.Номера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДемоПримерыОбменов/src/WebServices/booking/Module.bsl
Функция CreateBooking(Booking)

	ДанныеНовогоБронирования = ПрочитатьДанныеНовогоБронирования(Booking);	
	
	Запись = РегистрыСведений.ДатыБронирований.СоздатьМенеджерЗаписи();
	Запись.Номер = ДанныеНовогоБронирования.Номер;
	Запись.ДатаНачала = ДанныеНовогоБронирования.ДатаНачала;
	Запись.ДатаОкончания = ДанныеНовогоБронирования.ДатаОкончания;
	
	Запись.Записать();
	
	Возврат Booking;
	
КонецФункции

Функция GetBookings(Filter)
	
	Фильтры = ПрочитатьФильтры(Filter);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДатыБронирований.Номер КАК Номер,
		|	ДатыБронирований.ДатаНачала КАК ДатаНачала,
		|	ДатыБронирований.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ДатыБронирований КАК ДатыБронирований";
		
	ПрименитьФильтры(Запрос, Фильтры);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТипСписокБронирований = ФабрикаXDTO.Тип("http://narfu.ru/151315/booking", "books");
	СписокБронированийXDTO = ФабрикаXDTO.Создать(ТипСписокБронирований);
		
	Пока Выборка.Следующий() Цикл
		
		ТипОписаниеБронирования = ФабрикаXDTO.Тип("http://narfu.ru/151315/booking", "book");
		ОписаниеБронированияXDTO = ФабрикаXDTO.Создать(ТипОписаниеБронирования);
		
		ОписаниеБронированияXDTO.roomId = Строка(Выборка.Номер.УникальныйИдентификатор());
		ОписаниеБронированияXDTO.startDate = Выборка.ДатаНачала;
		ОписаниеБронированияXDTO.endDate = Выборка.ДатаОкончания;
		
		СписокБронированийXDTO.book.Добавить(ОписаниеБронированияXDTO)
		
	КонецЦикла;
	
	Возврат СписокБронированийXDTO;	

КонецФункции

Функция ПрочитатьФильтры(Filter)
			
	Результат = Новый Структура;
	Результат.Вставить("Номер");
	Результат.Вставить("ДатаНачала");
	Результат.Вставить("ДатаОкончания");
	
	Если Filter = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Filter.rooms) Тогда
		Номера = Новый Массив;
		Для Каждого Идентификатор Из Filter.rooms Цикл
			Если ЭтоУникальныйИдентификатор(Идентификатор) Тогда
				Номера.Добавить(Справочники.Номера.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор)));
			КонецЕсли;
		КонецЦикла;
		Результат.Номер = Номера;
	КонецЕсли;
	
	Результат.ДатаНачала = Filter.startDate;
	Результат.ДатаОкончания = Filter.endDate;

	Возврат Результат;
	
КонецФункции

Функция GetRooms()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номера.Код КАК Код,
		|	Номера.Наименование КАК Наименование,
		|	Номера.Ссылка КАК Ссылка,
		|	Номера.Описание КАК Описание
		|ИЗ
		|	Справочник.Номера КАК Номера";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТипСписокНомеров = ФабрикаXDTO.Тип("http://narfu.ru/151315/booking", "rooms");
	СписокНомеровXDTO = ФабрикаXDTO.Создать(ТипСписокНомеров);
		
	Пока Выборка.Следующий() Цикл
		
		ТипОписаниеНомера = ФабрикаXDTO.Тип("http://narfu.ru/151315/booking", "room");
		ОписаниеНомераXDTO = ФабрикаXDTO.Создать(ТипОписаниеНомера);
		
		ОписаниеНомераXDTO.id = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		ОписаниеНомераXDTO.code = Выборка.Код;
		ОписаниеНомераXDTO.name = Выборка.Наименование;
		ОписаниеНомераXDTO.description = Выборка.Описание;
		
		СписокНомеровXDTO.room.Добавить(ОписаниеНомераXDTO)
		
	КонецЦикла;
	
	Возврат СписокНомеровXDTO;

КонецФункции

Функция ping()
	Возврат Истина;
КонецФункции

// Функция проверяет, что строка является UUID через регулярное выражение
// Параметры:
//   Строка - Строка - строка, которую необходимо проверить
// Возвращаемое значение:
//   Булево - Истина, если строка является UUID
Функция ЭтоУникальныйИдентификатор(Строка)
	
	РегулярноеВыражение = "^[0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}$";
	Возврат СтрПодобнаПоРегулярномуВыражению(Строка, РегулярноеВыражение);
	
КонецФункции

// Применяет фильтры к тексту запроса на основе переданных параметров
//
// Параметры:
//   Запрос - Запрос - исходный запрос для применения фильтров
//   Фильтры - см. ПрочитатьФильтры
Процедура ПрименитьФильтры(Запрос, Фильтры)
	
	Схема = Новый СхемаЗапроса();
	Схема.УстановитьТекстЗапроса(Запрос.Текст);
	
	ЗапросПакета = Схема.ПакетЗапросов[0];
	Оператор = ЗапросПакета.Операторы[0];
	
	Если Фильтры.Номер <> Неопределено Тогда
		Оператор.Отбор.Добавить("ДатыБронирований.Номер В (&Номера)");
		Запрос.УстановитьПараметр("Номера", Фильтры.Номер);
	КонецЕсли;
	
	Если Фильтры.ДатаНачала <> Неопределено Тогда
		Оператор.Отбор.Добавить("ДатыБронирований.ДатаОкончания > &ДатаНачала");
		Запрос.УстановитьПараметр("ДатаНачала", Фильтры.ДатаНачала);
	КонецЕсли;
	
	Если Фильтры.ДатаОкончания <> Неопределено Тогда
		Оператор.Отбор.Добавить("ДатыБронирований.ДатаНачала < &ДатаОкончания");
		Запрос.УстановитьПараметр("ДатаОкончания", Фильтры.ДатаОкончания);
	КонецЕсли;
		
	Запрос.Текст = Схема.ПолучитьТекстЗапроса();
	
КонецПроцедуры

Функция ПрочитатьДанныеНовогоБронирования(Booking)
	
	Результат = Новый Структура;
	Результат.Вставить("Номер", ПолучитьНомер(Booking.roomId));
	Результат.Вставить("ДатаНачала", Booking.startDate);
	Результат.Вставить("ДатаОкончания", Booking.endDate);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНомер(ИдентификаторНомера)
	
	Если Не ЗначениеЗаполнено(ИдентификаторНомера) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЭтоУникальныйИдентификатор(ИдентификаторНомера) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ссылка = Справочники.Номера.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторНомера));
	
	Если Не НомерСуществует(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
			
	Возврат Ссылка;
	
КонецФункции

// Проверяет существование номера в справочнике по заданной ссылке.
//
// Параметры:
//   Ссылка - СправочникСсылка.Номера - Ссылка на проверяемый элемент справочника
//
// Возвращаемое значение:
//   Булево - Истина, если номер существует; Ложь в противном случае
Функция НомерСуществует(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номера.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номера КАК Номера
		|ГДЕ
		|	Номера.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции
